# Pandas: Merging, Joining, and Concatenating

In [1]:
import numpy as np 
import pandas as pd

## Join

In [15]:
left = pd.DataFrame({
    'key':["K0", "K1", "K2", "K3"],
    'A':["A0", "A1", "A2", "A3"],
    'B':["B0", "B1", "B2", "B3"]
}, index= [0,1,2,3])

In [16]:
right = pd.DataFrame({
    'key':["K0", "K1", "K3", "K4"],
    'C':["C0", "C1", "C2", "C3"],
    'D':["D0", "D1", "D2", "D3"]
}, index= [0,1,2,3])

In [8]:
pd.merge(left, right, on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C2  D2

In [9]:
pd.merge(left, right, how="outer", on="key")

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C2   D2
4  K4  NaN  NaN   C3   D3

In [10]:
pd.merge(left, right, how="right", on="key")

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K3   A3   B3  C2  D2
3  K4  NaN  NaN  C3  D3

In [11]:
pd.merge(left, right, how="left", on="key")

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C2   D2

In [17]:
left.set_index("key", inplace=True)

In [19]:
right.set_index("key", inplace=True)

In [21]:
left.join(right, how="outer")

       A    B    C    D
key
K0    A0   B0   C0   D0
K1    A1   B1   C1   D1
K2    A2   B2  NaN  NaN
K3    A3   B3   C2   D2
K4   NaN  NaN   C3   D3

## Concatenate

In [29]:
df1 = pd.DataFrame({
    'A':["A0", "A1", "A2", "A3"],
    'B':["B0", "B1", "B2", "B3"],
    'C':["C0", "C1", "C2", "C3"],
    'D':["D0", "D1", "D2", "D3"]
}, index= [0,1,2,3])

df2 = pd.DataFrame({
    'A':["A4", "A5", "A6", "A7"],
    'B':["B4", "B5", "B6", "B7"],
    'C':["C4", "C5", "C6", "C7"],
    'D':["D4", "D5", "D6", "D7"]
}, index= [4,5,6,7])

df3 = pd.DataFrame({
    'A':["A8", "A9", "A10", "A11"],
    'B':["B8", "B9", "B10", "B11"],
    'C':["C8", "C9", "C10", "C11"],
    'D':["D8", "D9", "D10", "D11"]
}, index= [8,9,10,11])

In [30]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [32]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Pandas Operation

In [33]:
# buat dictionary untuk datanya
dict_salary = {
    'name':['Kim Jisoo', 'Robert Downey', 'Johny Depp', 'Harry Maguire', 'Ana De Armas'],
    'gender':['F','M','M','M','F'],
    'hire_date':['2018-05-01', '2017-08-01', '2018-11-01', '2019-02-01', '2017-03-01'],
    'salary':[7000, 9000, 8000, 4000, 9000]
}

# buat list berisi nomor karyawan untuk indexnya
emp_number = np.arange(1001,1006)

# membuat dataframe dan disimpan dalam varieble df
df = pd.DataFrame(dict_salary, index=emp_number)
df

               name gender   hire_date  salary
1001      Kim Jisoo      F  2018-05-01    7000
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1004  Harry Maguire      M  2019-02-01    4000
1005   Ana De Armas      F  2017-03-01    9000

In [37]:
def hitung_bonus(salary):
    return salary * 0.1

In [38]:
df["salary"].apply(hitung_bonus)

1001    700.0
1002    900.0
1003    800.0
1004    400.0
1005    900.0
Name: salary, dtype: float64

In [39]:
df["name"].apply(len)

1001     9
1002    13
1003    10
1004    13
1005    12
Name: name, dtype: int64

In [40]:
df["salary"].apply(lambda salary: salary * 0.1)

1001    700.0
1002    900.0
1003    800.0
1004    400.0
1005    900.0
Name: salary, dtype: float64

In [41]:
df["name"].apply(lambda name: name[0])

1001    K
1002    R
1003    J
1004    H
1005    A
Name: name, dtype: object

In [42]:
df["name"].apply(lambda name: len(name))

1001     9
1002    13
1003    10
1004    13
1005    12
Name: name, dtype: int64

## Math Operation

In [43]:
df

               name gender   hire_date  salary
1001      Kim Jisoo      F  2018-05-01    7000
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1004  Harry Maguire      M  2019-02-01    4000
1005   Ana De Armas      F  2017-03-01    9000

In [44]:
df["bonus"] = df["salary"].apply(lambda salary: salary * 0.1)

In [45]:
df

               name gender   hire_date  salary  bonus
1001      Kim Jisoo      F  2018-05-01    7000  700.0
1002  Robert Downey      M  2017-08-01    9000  900.0
1003     Johny Depp      M  2018-11-01    8000  800.0
1004  Harry Maguire      M  2019-02-01    4000  400.0
1005   Ana De Armas      F  2017-03-01    9000  900.0

In [46]:
df["salary_and_bonus"] = df["salary"] + df["bonus"]

In [47]:
df

               name gender   hire_date  salary  bonus  salary_and_bonus
1001      Kim Jisoo      F  2018-05-01    7000  700.0            7700.0
1002  Robert Downey      M  2017-08-01    9000  900.0            9900.0
1003     Johny Depp      M  2018-11-01    8000  800.0            8800.0
1004  Harry Maguire      M  2019-02-01    4000  400.0            4400.0
1005   Ana De Armas      F  2017-03-01    9000  900.0            9900.0

## Pivot Table

In [48]:
df_sales = pd.DataFrame({
    'Kota': ['Jakarta', 'Jakarta','Jakarta','Tangerang','Tangerang','Tangerang'],
    'Cabang': [1,1,2,2,1,1],
    'Salesman': ['Jack','Alex','Jack','Alex','Jack','Alex'],
    'Profit': [10,20,30,40,50,60]
})

df_sales

        Kota  Cabang Salesman  Profit
0    Jakarta       1     Jack      10
1    Jakarta       1     Alex      20
2    Jakarta       2     Jack      30
3  Tangerang       2     Alex      40
4  Tangerang       1     Jack      50
5  Tangerang       1     Alex      60

In [49]:
# pivot_table
df_sales.pivot_table(
    index='Kota',
    columns='Salesman',
    values='Profit',
    aggfunc= np.sum  # defaultnya aggfunc='mean'
)

Salesman   Alex  Jack
Kota
Jakarta      20    40
Tangerang   100    50

In [50]:
# pivot_table kemudian diurutkan
df_sales.pivot_table(
    index='Kota',
    columns='Salesman',
    values='Profit',
    aggfunc= np.sum 
).sort_values(by='Jack', ascending=False)

Salesman   Alex  Jack
Kota
Tangerang   100    50
Jakarta      20    40

# I/O

In [13]:
df = pd.read_csv("data/data_sales.csv")

In [14]:
df

    Name   Product  Sales
0   Andy  Keyboard    500
1  Bella     Mouse    350
2  Chris   Monitor    800
3  Diana   Headset    450

In [15]:
df.to_csv("export_sales.csv", index=False)

In [16]:
df = pd.read_excel("data/data_sales.xlsx")

In [17]:
df

    Name   Product  Sales
0   Andy  Keyboard    500
1  Bella     Mouse    350
2  Chris   Monitor    800
3  Diana   Headset    450

In [18]:
df.to_excel("export_sales.xlsx", sheet_name = "Sheet1", index=False)

In [19]:
df = pd.read_json("data/data_sales.json")

In [20]:
df

    Name   Product  Sales
0   Andy  Keyboard    500
1  Bella     Mouse    350
2  Chris   Monitor    800
3  Diana   Headset    450

In [21]:
df.to_json("export_sales.json", orient="records")

In [11]:
import pandas as pd
tables = pd.read_html("https://www.w3schools.com/html/html_tables.asp")
df = tables[0]
print(df.head())

                        Company          Contact  Country
0           Alfreds Futterkiste     Maria Anders  Germany
1    Centro comercial Moctezuma  Francisco Chang   Mexico
2                  Ernst Handel    Roland Mendel  Austria
3                Island Trading    Helen Bennett       UK
4  Laughing Bacchus Winecellars  Yoshi Tannamuri   Canada